import json

# Paste your FULL original JSON string here (the one with paperId bangla2-01 to bangla2-09)
json_str = '''{
  "papers": [
    {
      "paperId": "bangla2-01",
      "board": "DB25",
      "questions": [
        {
          "id": "bangla2-01-q1",
          "text": "কর্তাবাচ্যের উদাহরণ কোনটি? DB 25",
          "options": [
            "আমার যাওয়া হলোনা।",
            "এবার বাঁশিটি বাজানো হোক।",
            "চিঠিটা পড়া হয়েছে।",
            "শরতে শিউলি ফোটে।"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q2",
          "text": "সাধারণত দুটি বাক্যকে এক বাক্যে পরিণত করার কাজে কোন যতিচিহ্ন বসে? DB 25",
          "options": [
            "কোলন",
            "সেমিকোলন",
            "ড্যাশ",
            "কমা"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q3",
          "text": "'কাছাঢিলা' বাগধারাটির অর্থ কোনটি? DB 25",
          "options": [
            "অসাবধান",
            "নির্বোধ",
            "কাডজ্ঞানহীন",
            "অলস"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q4",
          "text": "'হাতি' শব্দের প্রতিশব্দ কোনটি? DB 25",
          "options": [
            "উরগ",
            "দ্বিপ",
            "তুরগ",
            "কর"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q5",
          "text": "'খাতক' শব্দের বিপরীত শব্দ কোনটি? DB 25",
          "options": [
            "পালক",
            "ঘাতক",
            "বলবান",
            "মহাজন"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q6",
          "text": "'ঘোষ ব্যঞ্জন' ধ্বনি কোনগুলো? DB 25",
          "options": [
            "গ, ঘ",
            "ক, খ",
            "প, ফ",
            "ক, খ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q7",
          "text": "নিপাতনে সিদ্ধ ব্যপ্তনসন্ধি কোনটি? DB 25",
          "options": [
            "কুলটা",
            "গবাক্ষ",
            "একাদশ",
            "বনৌষধি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q8",
          "text": "'হাতাহাতি' কোন সমাস? DB 25",
          "options": [
            "দ্বন্দ্ব",
            "কর্মধারয়",
            "তৎপুরুষ",
            "বহুব্রীহি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q9",
          "text": "''ভাব' অর্থে প্রত্যয়যুক্ত হয়েছে কোন শব্দে? DB 25",
          "options": [
            "জমিদারি",
            "বাহাদুরি",
            "ডাক্তারি",
            "জেঠামি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q10",
          "text": "'অপসংস্কৃতি' শব্দের 'অপ' উপসর্গটি কী অর্থ প্রকাশ করে? DB 25",
          "options": [
            "মন্দ",
            "বিকৃত",
            "বাজে",
            "নিন্দনীয়"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q11",
          "text": "যেসব শব্দাংশ পদের সঙ্গে যুক্ত হলে বক্তব্য জোরালো হয় সেগুলোকে কী বলে? DB 25",
          "options": [
            "বিভক্তি",
            "বচন",
            "নির্দেশক",
            "বলক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q12",
          "text": "'ধ্বনাত্মক দ্বিত্বের' উদাহরণ কোনটি? DB 25",
          "options": [
            "ঝমঝম",
            "ঝিলমিল",
            "শেষ-মেষ",
            "চুপচাপ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q13",
          "text": "'নিত্য নারীবাচক' শব্দ কোনটি? DB 25",
          "options": [
            "ধোপানি",
            "শ্রীমতী",
            "বিধবা",
            "যোগিনী"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q14",
          "text": "'চশমা' কোন ভাষার শব্দ? DB 25",
          "options": [
            "আরবি",
            "ফারসি",
            "পর্তুগিজ",
            "তুর্কি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q15",
          "text": "যে-সে' কোন ধরনের সর্বনাম? DB 25",
          "options": [
            "সাপেক্ষ",
            "পারস্পরিক",
            "নির্দেশক",
            "আত্মবাচক"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q16",
          "text": "'ঠান্ডা পানি-এখানে 'ঠান্ডা' কোন বিশেষণ? DB 25",
          "options": [
            "উপাদানবাচক",
            "অবস্থাবাচক",
            "নির্দিষ্টতাবাচক",
            "গুণবাচক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q17",
          "text": "যৌগিক ক্রিয়ার উদাহরণ কোনটি? DB 25",
          "options": [
            "হেসে ওঠা",
            "লজ্জা পাওয়া",
            "গান করা",
            "সাঁতার কাটা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q18",
          "text": "পদ, বর্গ বা বাক্যকে যেসব শব্দ যুক্ত করে, সেগুলোকে কী বলে? DB 25",
          "options": [
            "লগ্নক",
            "বলক",
            "পূরক",
            "যোজক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q19",
          "text": "যাকগে, ওসব কথা থাক। বাক্যে 'যাকগে' কোন আবেগ? DB 25",
          "options": [
            "বিরক্তি",
            "সিদ্ধান্ত",
            "করুণা",
            "অলংকার"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q20",
          "text": "যেসব শব্দের শেষে কারচিহ্ন নেই,সেসব শব্দের শেষে কোন বিভক্তি হয়? DB 25",
          "options": [
            "-এর",
            "- য়ের",
            "-তে",
            "-র"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q21",
          "text": "প্রত্যক্ষ উক্তিতে চিরন্তন সত্যের উদ্ধৃতি থাকলে পরোক্ষ উক্তিতে ক্রিয়ার কীসের পরিবর্তন হয় না? DB 25",
          "options": [
            "ভাবের",
            "কালের",
            "অর্থের",
            "রূপের"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q22",
          "text": "বাংলা ভাযায় মৌলিক স্বরধ্বনি কয়টি? DB 25",
          "options": [
            "৭টি",
            "১১টি",
            "৩০টি",
            "৩৭টি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q23",
          "text": "বাংলা ভাষার নিকটতম আত্মীয় কোনটি? DB 25",
          "options": [
            "সংস্কৃত",
            "পালি",
            "অহমিয়া",
            "ফারসি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q24",
          "text": "চলিত রীতির নতুন নাম প্রমিত রীতি হয় কোন শতকে? DB 25",
          "options": [
            "আঠারো",
            "উনিশ",
            "বিশ",
            "একুশ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-01-q25",
          "text": "বাগযন্ত্রের মধ্যে সবচেয়ে সচল ও সক্রিয় প্রত্যঙ্গ কোনটি? DB 25",
          "options": [
            "ওষ্ঠ",
            "তালু",
            "জিভ",
            "দন্ত"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q26",
          "text": "বাংলা ভাষায় অর্ধস্বরধ্বনি কয়টি? DB 25",
          "options": [
            "২টি",
            "৪টি",
            "৬টি",
            "৮টি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q27",
          "text": "'সকলের মঙ্গল হোক'বাক্যটি কোন কালের উদাহরণ? DB 25",
          "options": [
            "অনুজ্ঞা বর্তমান",
            "অনুজ্ঞা ভবিষ্যৎ",
            "সাধারণ ভবিষ্যৎ",
            "সাধারণ বর্তমান"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-01-q28",
          "text": "'সে খেয়ে আর ঘুমিয়ে কাটাচ্ছে বাক্যে 'খেয়ে আর ঘুমিয়ে' কোন বর্গ? DB 25",
          "options": [
            "ক্রিয়াবর্গ",
            "ক্রিয়াবিশেষণ বর্গ",
            "বিশেষ্যবর্গ",
            "বিশেষণবর্গ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-01-q29",
          "text": "বিধেয় ক্রিয়ার বিশেষ্য অংশকে কী বলা হয়? DB 25",
          "options": [
            "বলক",
            "লগ্নক",
            "পূরক",
            "প্রসারক"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-01-q30",
          "text": "'জমি থেকে ফসল পাই।' বাক্যে 'জমি থেকে' কোন কারক? DB 25",
          "options": [
            "কর্ম",
            "করণ",
            "অপাদান",
            "অধিকরণ"
          ],
          "answer": 2
        }
      ]
    },
    {
      "paperId": "bangla2-02",
      "board": "MB25",
      "questions": [
        {
          "id": "bangla2-02-q1",
          "text": "বাংলা ভাষার নিজস্ব লিপির নাম কী? MB 25",
          "options": [
            "ব্রাহ্মী",
            "কুঠিল",
            "মণিপুরি",
            "বাংলা"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q2",
          "text": "বাংলা ভাষার ক্ষুদ্রতম একক কোনটি? MB 25",
          "options": [
            "শব্দ",
            "বাক্য",
            "অক্ষর",
            "ধ্বনি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q3",
          "text": "শক্ত তালু ও উপরের পাটির দাঁতের মধ্যবর্তী উত্তল অংশকে কী বলে? MB 25",
          "options": [
            "ওষ্ঠ্য",
            "মূর্ধা",
            "দন্তমূল",
            "নাসিকা"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q4",
          "text": "আকাশ শব্দের প্রতিশব্দ কোনটি? MB 25",
          "options": [
            "আগুন",
            "অন্তরীক্ষ",
            "ইচ্ছা",
            "পৃথিবী"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q5",
          "text": "যেসব স্বরধ্বনি পুরোপুরি উচ্চারিত হয় না, তাদেরকে কী বলে? MB 25",
          "options": [
            "হ্রস্বস্বর",
            "অর্ধস্বর",
            "দীর্ঘস্বর",
            "পূর্ণস্বর"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q6",
          "text": "কর্তা নিজেই কোনো কাজ করেছে, এ ভাবটি জোর দিয়ে বোঝানোর জন্য যে ধরনের সর্বনাম ব্যবহার করা হয় তা হলো- MB 25",
          "options": [
            "উনি",
            "এই",
            "স্বয়ং",
            "যে-সে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-02-q7",
          "text": "'চলন্ত ট্রেন থেকে লাফ দিয়ো না।'-বাক্যটিতে 'চলন্ত' কোন জাতীয় বিশেষণ? MB 25",
          "options": [
            "নির্দিষ্টতাবাচক",
            "গুণবাচক",
            "অবস্থাবাচক",
            "ভাববাচক"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-02-q8",
          "text": "নিচের কোনটি যৌগিক ক্রিয়ার উদাহরণ? MB 25",
          "options": [
            "পকেট মারা",
            "চেপেরাখা",
            "ছটফটায়",
            "খাওয়ায়"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q9",
          "text": "'টিপ টিপ বৃষ্টি পড়ছে।'-বাক্যটিতে কোন ধরনের ক্রিয়া বিশেষণ ব্যবহৃত হয়েছে? MB 25",
          "options": [
            "ধরনবাচক",
            "কালবাচক",
            "স্থানবাচক",
            "নেতিবাচক"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q10",
          "text": "'যত পড়ছি ততই নতুন করে জানছি।'-এ বাক্যে অন্তরীক্ষ কোন ধরনের যোজক ব্যবহার করা হয়েছে? MB 25",
          "options": [
            "সাধারণ",
            "বিরোধ",
            "বিকল্প",
            "সাপেক্ষ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q11",
          "text": "নিচের কোন বাক্যে প্রশংসা আবেগ ব্যবহারকরা হয়েছে? MB 25",
          "options": [
            "বাহ, চমৎকার লিখেছ।",
            "উহ্, কী বিপদে পড়া গেল।",
            "হায় হায়, ওর এখন কী হবে!",
            "ওগো, তোরা জয়ধ্বনি কর।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q12",
          "text": "'নিয়ম' শব্দটিকে বহুচন করতে নিচের কোন লগ্নক যোগ করতে হয়? MB 25",
          "options": [
            "গণ",
            "বৃন্দ",
            "মালা",
            "আবলি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q13",
          "text": "মাতৃভাষী মানুষের সংখ্যা কত? MB 25",
          "options": [
            "কে",
            "তে",
            "র",
            "এর"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q14",
          "text": "নিচের কোন বাক্যটি সাধারণ বর্তমান কালের উদাহরণ? MB 25",
          "options": [
            "সূর্য পূর্বদিকে ওঠে।",
            "তারা বাড়ি ফিরেছে।",
            "সকলের মঙ্গল হোক।",
            "ভালোভাবে পৌঁছে যেয়ো।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q15",
          "text": "নিচের কোনটি বিবৃতিবাচক বাক্য? MB 25",
          "options": [
            "আমাকে একটি কলম দাও।",
            "তোমার নাম কী?",
            "তারা তোমাদের ভোলেনি।",
            "দারুশ! আমরা জিতে গিয়েছি।"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-02-q16",
          "text": "নিচের কোন বাক্যে বিশেষণবর্গ রয়েছে? MB 25",
          "options": [
            "সকাল আটটার সময়ে সে রওয়ানা হলো।",
            "অসুস্থ ছেলেটি আজ আজ স্কুলে আসেনি।",
            "ভদ্রলোক সত্যিকারের নির্লোত।",
            "সে লিখছে আর হাসছে।"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q17",
          "text": "যে-সে,যারা-তারা, যখন-তখন প্রভৃতি সাপেক্ষ সর্বনাম এবং যোজক দিয়ে যখন অধীন বাক্যগুলো যুক্ত থাকে, তখন তাকে কী বলে? MB 25",
          "options": [
            "সরল বাক্য",
            "জটিল বাক্য",
            "যৌগিক বাক্য",
            "সাপেক্ষ বাক্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q18",
          "text": "'অসহায়কে সাহায্য করো।' এই বাক্যে 'অসহায়কে' কোন কারক? MB 25",
          "options": [
            "কর্ম",
            "কর্তা",
            "করণ",
            "অধিকরণ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q19",
          "text": "বাক্যের প্রকাশ ভঙ্গিকে কী বলে? MB 25",
          "options": [
            "উক্তি",
            "বিভক্তি",
            "কারক",
            "বাচ্য"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q20",
          "text": "কোনটি সামান্যবিরতি নির্দেশ করে? MB 25",
          "options": [
            "কমা",
            "সেমিকোলন",
            "হাইফেন",
            "কোলন"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q21",
          "text": "রূপতত্ত্বে বিশেষ গুরুত্ব পায় কী? MB 25",
          "options": [
            "বিশেষ্যের আলোচনা",
            "ক্রিয়া বিশেষণ",
            "শব্দ গঠন প্রক্রিয়া",
            "ক্রিয়া বিশ্লেষণ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-02-q22",
          "text": "কারক বোঝাতে পদের সঙ্গে যেসব শব্দাংশ যুক্ত থাকে সেগুলোকে কী বলে? MB 25",
          "options": [
            "বলক",
            "বিভক্তি",
            "প্রত্যয়",
            "উপসর্গ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q23",
          "text": "নিচের কোন শব্দে 'অভি' উপসর্গটি 'উত্তম' অর্থে ব্যবহৃত হয়েছে? MB 25",
          "options": [
            "অভিজ্ঞ",
            "অভিমান",
            "অভিমত",
            "অভিজাত"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q24",
          "text": "নিচের কোনটি কৃদন্ত শব্দের উদাহরণ? MB 25",
          "options": [
            "পানসে",
            "লাপট",
            "কাটতি",
            "চতুর্থ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-02-q25",
          "text": "সন্নিহিত অনুসর্গ লোপ পাওয়া তৎপুরুষ সমাসের উদাহরণ নিচের কোনটি? MB 25",
          "options": [
            "আলুসিদ্ধ",
            "মধুমাখা",
            "চোখেমুখে",
            "ত্রিফলা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q26",
          "text": "নিচের কোনটি নিপাতনে সিদ্ধ ব্যঞ্জন সন্ধির উদাহরণ? MB 25",
          "options": [
            "বৃহস্পতি",
            "সম্ভাপ",
            "ষষ্ঠ",
            "চলচ্চিত্র"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-02-q27",
          "text": "যে-সে প্রাকৃতিক ধ্বনির অনুকরণে যেসব শব্দ তৈরি হয়, সেগুলোকে কী বলে? MB 25",
          "options": [
            "অনুকার দ্বিত্ব",
            "পুনরাবৃত্ত দ্বিত্ব",
            "পদদ্বিত্ব",
            "ধ্বন্যাত্মক শব্দ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q28",
          "text": "নিচের কোন শব্দটি নিত্য নারীবাচকের উদাহরণ? MB 25",
          "options": [
            "ভাইঝি",
            "বিধবা",
            "শ্রীমতি",
            "কনে"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-02-q29",
          "text": "উৎস বিবেচনায় বাংলা শব্দভান্ডারকে কয় শ্রেণিতে বিভক্ত করা যায়? MB 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-02-q30",
          "text": "নিচের কোনটি গুণ-বিশেষ্য-এর উদাহরণ? MB 25",
          "options": [
            "সঞ্চিতা",
            "পর্বত",
            "জনতা",
            "সরলতা"
          ],
          "answer": 3
        }
      ]
    },
    {
      "paperId": "bangla2-03",
      "board": "RB25",
      "questions": [
        {
          "id": "bangla2-03-q1",
          "text": "'পানি' কোন ভাষা হতে আগত শব্দ? RB 25",
          "options": [
            "ফারসি",
            "ফরাসি",
            "হিন্দি",
            "তুর্কি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q2",
          "text": "'আনন্দ' কোন প্রকার বিশেষ্যের উদাহরণ? RB 25",
          "options": [
            "গুণ-বিশেষ্য",
            "ক্রিয়া-বিশেষ্য",
            "সমষ্টি-বিশেষ্য",
            "নাম-বিশেষ্য"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q3",
          "text": "নিচের কোনটি আত্মবাচক সর্বনাম? RB 25",
          "options": [
            "উনি",
            "স্বয়ং",
            "কেউ",
            "সকলে"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q4",
          "text": "\"গাড়িটা বেশ জোরে চলছে\"-বাক্যটিতে 'বেশ' কোন জাতীয় বিশেষণ? RB 25",
          "options": [
            "নির্দিষ্টতাবাচক",
            "গুণবাচক",
            "অবস্থাবাচক",
            "ভাববাচক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q5",
          "text": "\"তিনি আমাকে অঙ্ক করাচ্ছেন\"-বাক্যটিতে কোন ক্রিয়ার উদাহরণ রয়েছে? RB 25",
          "options": [
            "সরল ক্রিয়া",
            "নামক্রিয়া",
            "প্রযোজক ক্রিয়া",
            "যৌগিক ক্রিয়া"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q6",
          "text": "কোনটি ক্রিয়াজাত অনুসর্গের উদাহরণ? RB 25",
          "options": [
            "কাছে",
            "আপন",
            "বলে",
            "জোরে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q7",
          "text": "নিচের কোনটি আতঙ্ক আবেগের উদাহরণ? RB 25",
          "options": [
            "ছি ছি!",
            "বাপরে বাপ!",
            "আরে!",
            "আহা!"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q8",
          "text": "'রচনা' শব্দকে বহুবচন করতে কোন লগ্নকটি ব্যবহৃত হয়? RB 25",
          "options": [
            "মালা",
            "বৃন্দ",
            "বর্গ",
            "আবলি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q9",
          "text": "\"তাড়াতাড়ি কাজটি কোরো\"-বাক্যটি কোন কালের? RB 25",
          "options": [
            "অনুজ্ঞা বর্তমান",
            "নিত্য অতীত",
            "অনুজ্ঞা ভবিষ্যৎ",
            "সাধারণ বর্তমান"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q10",
          "text": "\"তিনি বাংলাদেশের নাগরিক\"-কোন ধরনের বাক্যের উদাহরণ ? RB 25",
          "options": [
            "অক্রিয় বাক্য",
            "সক্রিয় বাক্য",
            "যৌগিক বাক্য",
            "জটিল বাক্য"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q11",
          "text": "বিপদ ও দুঃখ একসঙ্গে আসে-এটি কোন বাক্যের উদাহরণ? RB 25",
          "options": [
            "জটিল বাক্য",
            "যৌগিক বাক্য",
            "সরল বাক্য",
            "অক্রিয় বাক্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q12",
          "text": "\"বাবা বাড়িতে আছেন।\"-এই বাক্যে 'বাড়িতে' কোন কারক? RB 25",
          "options": [
            "অপাদান",
            "করণ",
            "কর্ম",
            "অধিকরণ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q13",
          "text": "প্রত্যক্ষ উক্তিকে পরোক্ষ উক্তিতে পরিবর্তনের সময়ে কী ধরনের শব্দের পরিবর্তন হয়? RB 25",
          "options": [
            "কালবাচক ও ভাববাচক",
            "বাববাচক ও স্থানবাচক",
            "কালবাচক ও স্থানবাচক",
            "আবেগ ও যোজক"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q14",
          "text": "\"কখন আসা হলো?\"-এই বাক্যে কোন বাচ্যের উদাহরণ? RB 25",
          "options": [
            "ভাববাচ্য",
            "কর্তাবাচ্য",
            "কর্মবাচ্য",
            "কর্তা-কর্মবাচ্য"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q15",
          "text": "উদাহরণ উপস্থাপনের কাজে কোন যতিচিহ্নির ব্যবহার হয়? RB 25",
          "options": [
            "ড্যাশ",
            "কোলন",
            "হাইফেন",
            "সেমিকোলন"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q16",
          "text": "'গবাক্ষ' শব্দের দ্বারা জানালা বোঝালে অর্থের কী ধরনের পরিবর্তন হয়? RB 25",
          "options": [
            "অর্থপ্রসার",
            "অর্থসংকোচ",
            "অর্থের অবনতি",
            "অর্থ-বদল"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q17",
          "text": "'অত্যন্ত গরিব' অর্থ কোন বাগধারার মধ্যে রয়েছে? RB 25",
          "options": [
            "ননীর পুতুল",
            "তালকানা",
            "ছা-পোষা",
            "ঠোঁট কাটা"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q18",
          "text": "'অতিথি' শব্দের প্রতিশব্দ কোনটি? RB 25",
          "options": [
            "অভ্যাগত",
            "অরবিন্দ",
            "অংশূমালী",
            "অভিলাষ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q19",
          "text": "'গূঢ়' শব্দের বিপরীত শব্দ কোনটি? RB 25",
          "options": [
            "অধিক",
            "ব্যক্ত",
            "মূর্খ",
            "শুথ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q20",
          "text": "'শিল' ও 'শীল' শব্দের অর্থ যথাক্রমে কী কী হবে? RB 25",
          "options": [
            "পাথর ও ক্ষরণ",
            "পবিত্র ও চরিত্র",
            "বদন ও চরিত্র",
            "পাথর ও চরিত্র"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q21",
          "text": "ভারতের পশ্চিমবঙ্গে বাংলাভাষী মানুষের সংখ্যা কত? RB 25",
          "options": [
            "নয় কোটি",
            "দশ কোটি",
            "এগারো কোটি",
            "বারো কোটি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q22",
          "text": "বাংলা ভাষায় লেখা প্রথম বাংলা ব্যাকরণ প্রকাশিত হয় কত খ্রিষ্টাব্দে? RB 25",
          "options": [
            "১৮৩০",
            "১৮৩১",
            "১৮৩২",
            "১৮৩৩"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q23",
          "text": "ধ্বনি সৃষ্টিকারী বায়ু প্রবাহের উৎস কোনটি? RB 25",
          "options": [
            "শ্বাসনালি",
            "স্বরযন্ত্র",
            "ফুসফুস",
            "আলজিভ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q24",
          "text": "'হ্ম' যুক্তবর্ণটি কোন কোন বর্ণ দিয়ে গঠিত? RB 25",
          "options": [
            "হ্+ম",
            "ক্+ষ",
            "ক্+স",
            "হ্+ষ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q25",
          "text": "কোনগুলো তাড়িত ব্যঞ্জন? RB 25",
          "options": [
            "ব, ম",
            "ড়,ঢ়",
            "প, ত",
            "স, হ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-03-q26",
          "text": "'নিমরাজি' শব্দের 'নিম' উপসর্গটি কোন অর্থে ব্যবহৃত হয়েছে? RB 25",
          "options": [
            "প্রায়",
            "অভাব",
            "অর্ধেক",
            "সামান্য"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q27",
          "text": "জাত অর্থে কোন শব্দটি ব্যবহার হয়েছে? RB 25",
          "options": [
            "কানাই",
            "গেঁয়ো",
            "ঢাকাই",
            "মেটে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-03-q28",
          "text": "রূপক কর্মধারয় সমাসের উদাহরণ কোনটি? RB 25",
          "options": [
            "মনমাঝি",
            "চন্দ্রমুখ",
            "ঘিভাত",
            "ত্রিফলা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-03-q29",
          "text": "নিচের কোনটি বিসর্গ সন্ধির উদাহরণ? RB 25",
          "options": [
            "সম্মান",
            "পুরস্কার",
            "উল্লাস",
            "শয়ন"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-03-q30",
          "text": "কোনটি রুপার আপেক্ষিক রোধ? RB 25",
          "options": [
            "লাম",
            "রূপা",
            "সোনা",
            "কোনোটিই নয়"
          ],
          "answer": 3
        }
      ]
    },
    {
      "paperId": "bangla2-04",
      "board": "DINB25",
      "questions": [
        {
          "id": "bangla2-04-q1",
          "text": "এত পড়লাম, কিন্তু পরীক্ষায় ভালো করতে পারলাম না। বাক্যে 'কিন্তু' কোন ধরনের যোজক? DIN.B 25",
          "options": [
            "সাধারণ",
            "বিরোধ",
            "কারণ",
            "সাপেক্ষ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q2",
          "text": "বিধেয় ক্রিয়ার বিশেষ্য অংশকে কী বলে? DIN.B 25",
          "options": [
            "পূরক",
            "প্রসারক",
            "লগ্নক",
            "উদ্দেশ্য"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q3",
          "text": "'পার্শ্বিক' ব্যঞ্জনধ্বনির উদাহরণ কোনটি? DIN.B 25",
          "options": [
            "ল",
            "র",
            "ঢ়",
            "হ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q4",
          "text": "'নৈপুণ্য' অর্থে প্রত্যয়জাত শব্দ কোনটি? DIN.B 25",
          "options": [
            "বাহাদুরি",
            "ডাক্তারি",
            "মেটে",
            "নেয়ে"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q5",
          "text": "নিত্য 'নরবাচক' শব্দ কোনটি? DIN.B 25",
          "options": [
            "গুরু",
            "শিক্ষক",
            "কৃতদার",
            "বিজয়ী"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q6",
          "text": "'আরবি' ভাষার শব্দ কোনটি? DIN.B 25",
          "options": [
            "নামাজ",
            "রোজা",
            "দোজখ",
            "জাকাত"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q7",
          "text": "'সাধারণ-বিশেষ্য' নামে পরিচিত কোনটি? DIN.B 25",
          "options": [
            "নাম-বিশেষ্য",
            "জাতি-বিশেষ্য",
            "বস্তু-বিশেষ্য",
            "ক্রিয়া-বিশেষ্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q8",
          "text": "পরস্পর নির্ভরশীল দুটি সর্বনামকে কোন সর্বনাম বলে? DIN.B 25",
          "options": [
            "সাপেক্ষ",
            "পারস্পরিক",
            "নির্দেশক",
            "অনির্দিষ্ট"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q9",
          "text": "'কর্মবাচ্যের' উদাহরণ কোনটি? DIN.B 25",
          "options": [
            "শরতে শিউলি ফোটে।",
            "এবার বাঁশিটি বাজানো হোক।",
            "চিঠিটা পড়া হয়েছে।",
            "আমার যাওয়া হলো না।"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q10",
          "text": "'খুব ভালো খবর' বাক্যে 'খুব' কোন বিশেষণ? DIN.B 25",
          "options": [
            "গুণবাচক",
            "অবস্থাবাচক",
            "ভাববাচক",
            "পরিমাণবাচক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q11",
          "text": "'ঠোঁটকাটা' বাগধারা সমার্থক কোনটি? DIN.B 25",
          "options": [
            "কানকাটা",
            "চশমখোর",
            "কাঠখোট্টা",
            "বর্ণচোরা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q12",
          "text": "বাগযন্ত্রের মধ্যে সবচেয়ে সচল ও সক্রিয় প্রত্যঙ্গ কোনটি? DIN.B 25",
          "options": [
            "ওষ্ঠ",
            "তালু",
            "দন্ত",
            "জিভ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q13",
          "text": "'গবাক্ষ' শব্দের দ্বারা 'জানালা' বোঝালে অর্থের কোনটি ঘটে? DIN.B 25",
          "options": [
            "অর্থবদল",
            "অর্থের উন্নতি",
            "অর্থসংকোচ",
            "অর্থপ্রসার"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q14",
          "text": "গঠনগত দিক থেকে বাক্য কত প্রকার? DIN.B 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q15",
          "text": "'নিমরাজি' শব্দের 'নিম' উপসর্গটি কী অর্থে ব্যবহৃত হয়েছে? DIN.B 25",
          "options": [
            "প্রায়",
            "অভাব",
            "অর্ধেক",
            "সামান্য"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q16",
          "text": "'অনুকার দ্বিত্ব’ কোনটি? DIN.B 25",
          "options": [
            "ঝম ঝম",
            "খক খক",
            "টস টস",
            "ঝিলমিল"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q17",
          "text": "বিশেষ্য, বিশেষণ বা ধ্বন্যাত্মক শব্দের শেষে-আ বা-আনো প্রত্যয় যুক্ত হয়ে যে ক্রিয়া গঠিত হয়, তাকে কী বলে? DIN.B 25",
          "options": [
            "সরল ক্রিয়া",
            "প্রযোজক ক্রিয়া",
            "নামক্রিয়া",
            "যোগিক ক্রিয়া"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q18",
          "text": "'পদাণু ক্রিয়াবিশেষণ' রয়েছে কোন বাক্যে? DIN.B 25",
          "options": [
            "মরি তো মরব।",
            "সে এখন যাবে না।",
            "যথাসময়ে সে হাজির হয়।",
            "টিপটিপ বৃষ্টি পড়ছে।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q19",
          "text": "প্রাণী বা বস্তুর নামকে বহুবচন করতে কী লগ্নক ব্যবহার করা হয়? DIN.B 25",
          "options": [
            "সব",
            "দের",
            "গুলো",
            "বর্গ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q20",
          "text": "মাতৃভাষী মোট জনসংখ্যার ভিত্তিতে বাংলা পৃথিবীর কততম বৃহত্তম ভাষা? DIN.B 25",
          "options": [
            "চতুর্থ",
            "পঞ্চম",
            "ষষ্ঠ",
            "সপ্তম"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q21",
          "text": "'বাগধারা' ব্যাকরণের কোন অংশের আলোচ্য বিষয়? DIN.B 25",
          "options": [
            "ধ্বনিতত্ত্ব",
            "রূপতত্ত্ব",
            "বাক্যতত্ত্ব",
            "অর্থতত্ত্ব"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q22",
          "text": "মধ্যপদলোপী কর্মধারয় সমাসের উদাহরণ কোনটি? DIN.B 25",
          "options": [
            "কাজলকালো",
            "বিজয় পতাকা",
            "ত্রিফলা",
            "ত্রিফলা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q23",
          "text": "নিপাতনে সিদ্ধ স্বরসন্ধি কোনটি? DIN.B 25",
          "options": [
            "গবাক্ষ",
            "একাদশ",
            "বৃহস্পতি",
            "গোষ্পদ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q24",
          "text": "লগ্নক কয় ধরনের? DIN.B 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q25",
          "text": "ফুলের গন্ধে ঘুম আসে না। বাক্যে 'ফুলের' কোন কারক? DIN.B 25",
          "options": [
            "কর্ম",
            "অপাদান",
            "অধিকরণ",
            "সম্বন্ধ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q26",
          "text": "একই ধরনের বর্গকে পাশাপাশি সাজাতে কোন যতিচিহ্ন বসে? DIN.B 25",
          "options": [
            "কমা",
            "সেমিকোলন",
            "হাইফেন",
            "কোলন"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-04-q27",
          "text": "বাংলায় মৌলিক ধ্বনি কয়টি? DIN.B 25",
          "options": [
            "৭টি",
            "৩০টি",
            "৩৭টি",
            "৫০টি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-04-q28",
          "text": "'ভীরু' শব্দের বিপরীত শব্দ কোনটি? DIN.B 25",
          "options": [
            "নির্ভীক",
            "সাহসী",
            "জাগ্রত",
            "প্রবল"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-04-q29",
          "text": "'বাতাস' শব্দের প্রতিশব্দ কোনটি? DIN.B 25",
          "options": [
            "1.5×10^8 ms-1",
            "2×10^8 ms-1",
            "2.5×10^8 ms-1",
            "3×10^8 ms-1"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-04-q30",
          "text": "'উদাহরণ উপস্থাপনের কাজে কোন যতিচিহ্নির ব্যবহার হয়? DIN.B 25",
          "options": [
            "এমন কাজ তোমার দ্বারা হবে না।",
            "মন দিয়ে লেখাপড়া করা দরকার।",
            "মাথার উপরে নীল আকাশ।",
            "আজ বাংলাদেশ বনাম ভারতের খেলা।"
          ],
          "answer": 1
        }
      ]
    },
    {
      "paperId": "bangla2-05",
      "board": "CB25",
      "questions": [
        {
          "id": "bangla2-05-q1",
          "text": "'রেস্তোরাঁ' কোন ভাষার শব্দ? CB 25",
          "options": [
            "পর্তুগিজ",
            "ইংরেজি",
            "ফারসি",
            "ফরাসি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q2",
          "text": "'অপরাজেয় বাংলা' কোন পদের উদাহরণ? CB 25",
          "options": [
            "গুণ-বিশেষ্য",
            "জাতি-বিশেষ্য",
            "সৃষ্টিনাম-বিশেষ্য",
            "কালনাম-বিশেষ্য"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q3",
          "text": "গতকাল একজন বিদেশ গেল।-এ বাক্যে 'একজন' শব্দটি কোন সর্বনাম? CB 25",
          "options": [
            "নির্দেশক",
            "সাপেক্ষ",
            "প্রশ্নবাচক",
            "অনির্দিষ্ট"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q4",
          "text": "অনুসর্গকে কত ভাগে ভাগ করা যায়? CB 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q5",
          "text": "কোন ধরনের যোজক একে অন্যের পূরক হয়ে বাক্যে ব্যবহৃত হয়? CB 25",
          "options": [
            "বিকল্প যোজক",
            "বিরোধ যোজক",
            "কারণ যোজক",
            "সাপেক্ষ যোজক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q6",
          "text": "’ বেশ, তবে সেটাই হোক'—বাক্যটি কোন আবেগের উদাহরণ? CB 25",
          "options": [
            "প্রশংসা আবেগ",
            "বিস্ময় আবেগ",
            "সিদ্ধান্ত আবেগ",
            "আতঙ্ক আবেগ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q7",
          "text": "রাখাল গরুকে ঘাস খাওয়ায় এখানে 'খাওয়ায়' কোন ক্রিয়া? CB 25",
          "options": [
            "প্রযোজক",
            "সংযোগ",
            "যৌগিক",
            "নাম"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-05-q8",
          "text": "শব্দ,বর্গ ও অধীনবাক্যকে আলাদা করতে ব্যবহৃত হয় - CB 25",
          "options": [
            "কমা",
            "দাঁড়ি",
            "সেমিকোলন",
            "কোলন"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-05-q9",
          "text": "কোন লগ্নকগুলো উন্নত প্রাণিবাচক বা মানী পক্ষের বহুবচনে ব্যবহৃত হয়? CB 25",
          "options": [
            "গণ, বৃন্দ, সব, সকল",
            "গণ, বৃন্দ, বর্গ, মণ্ডলী",
            "গণ, বৃন্দ, সমূহ, সব",
            "গণ, মন্ডলী, কুল, সকল"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q10",
          "text": "তারা সাগরের তীরে ঝিনুক কুড়াত।বাক্যের 'কুড়াত' ক্রিয়াটি কোন কাল নির্দেশ করে? CB 25",
          "options": [
            "পুরাঘটিত অতীত",
            "পুরাঘটিত বর্তমান",
            "সাধারণ অতীত",
            "নিত্য অতীত"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q11",
          "text": "'আমি ব্যাকরণে খুব কাঁচা-কোনটি অধিকরণ কারক? CB 25",
          "options": [
            "আমি",
            "ব্যাকরণে",
            "খুব",
            "কাঁচা"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q12",
          "text": "বাচ্য বলতে বোঝায় কী? CB 25",
          "options": [
            "বাক্যের অর্থ",
            "বাক্যের ভাব",
            "বাক্যের প্রকাশভঙ্গি",
            "বাক্যের প্রয়োগ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q13",
          "text": "'উড়নচণ্ডি' বাগারার অর্থ- CB 25",
          "options": [
            "অপব্যবহার",
            "সুযোগসন্ধানী",
            "অরাজকতা",
            "নতুন আগমন"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q14",
          "text": "সূর্যের সমার্থক শব্দ কোনটি? CB 25",
          "options": [
            "অম্বর",
            "অংশূ",
            "মার্তন্ড",
            "সুধাকর"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q15",
          "text": "বাংলা লিপি কোন লিপির বিবর্তিত রূপ? CB 25",
          "options": [
            "ব্রাহ্মী লিপি",
            "কুটিল লিপি",
            "জটিল লিপি",
            "সংস্কৃত লিপি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q16",
          "text": "'কারক বিশ্লেষণ' ব্যাকরণের কোন অংশে আলোচিত হয়? CB 25",
          "options": [
            "শব্দতত্ত্বে",
            "অর্থতত্ত্বে",
            "বাক্যতত্ত্বে",
            "ধ্বনিতত্ত্বে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q17",
          "text": "বাংলাদেশের রংপুর অঞ্চলে কোন উপভাষার ব্যবহার পাওয়া যায়? CB 25",
          "options": [
            "বরেন্দ্রি",
            "রাঢ়ি",
            "কামরূপি",
            "পূর্বি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q18",
          "text": "কোমল তালু ও জিভমূলের স্পর্শে কোন ধ্বনি উচ্চারিত হয়? CB 25",
          "options": [
            "ওষ্ঠ্য ধ্বনি",
            "দন্ত্যব্যঞ্জন ধ্বনি",
            "তালব্য ব্যঞ্জন ধ্বনি",
            "কণ্ঠ্য ধ্বনি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q19",
          "text": "ব্যঞ্জন বর্ণের বিকল্প রূপের নাম কী? CB 25",
          "options": [
            "কার বর্ণ",
            "অনুবর্ণ",
            "ফলা",
            "রেফ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q20",
          "text": "কোনগুলো নিম্ন-মধ্য স্বরধ্বনি? CB 25",
          "options": [
            "[অ্যা), [অ)",
            "[অ্যা], [আ)",
            "[অ্যা], [ও]",
            "[ও], [উ]"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q21",
          "text": "কোনটি তাড়িত ব্যঞ্জনের উদাহরণ? CB 25",
          "options": [
            "'র'",
            "‘ড়’",
            "’শ’",
            "’ণ’"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-05-q22",
          "text": "'হরিণ'শব্দের সঠিক উচ্চারণ কোনটি? CB 25",
          "options": [
            "[হরিন্]",
            "[হোরিন্]",
            "[হরিণ]",
            "[হরীণ]"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q23",
          "text": "\"নৌকার ছইয়ে নীল মাছরাঙাটি বসে আছে।\"— এ বাক্যে অলগ্নক পদ কোনটি? CB 25",
          "options": [
            "নীল",
            "নৌকার",
            "ছইয়ে",
            "মাছরাঙাটি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-05-q24",
          "text": "নিচের কোন শব্দে পালটা অর্থে 'প্রতি' উপসর্গটি ব্যবহৃত হয়েছে? CB 25",
          "options": [
            "প্রতিদিন",
            "প্রতিহিংসা",
            "প্রতিযোগিতা",
            "প্রতিবিম্ব"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q25",
          "text": "কৃৎ প্রত্যয় দিয়ে সাধিতশব্দকে কী বলে? CB 25",
          "options": [
            "ক্রিয়া শব্দ",
            "তদ্ধিত শব্দ",
            "কৃদন্ত শব্দ",
            "তদ্ধিতান্ত শব্দ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-05-q26",
          "text": "'এ + অন্যস্বর = ঘয় + স্বর' -এ সূত্রে সাধিত সন্ধির উদাহরণ কোনটি? CB 25",
          "options": [
            "উত্তরাধিকার",
            "শয়ন",
            "অতীন্দ্রিয়",
            "নাবিক"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q27",
          "text": "'ঘর-টর' শব্দটি কোন প্রকার শব্দদ্বিত্ব? CB 25",
          "options": [
            "অনুকার দ্বিত্ব",
            "ধ্বন্যাত্মক দ্বিত্ব",
            "পদাত্মক",
            "পুনরাবৃত্ত দ্বিত্ব"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-05-q28",
          "text": "কোনটি নিত্য নরবাচক শব্দ? CB 25",
          "options": [
            "ছেলে",
            "নেতা",
            "জেলে",
            "কৃতদার"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q29",
          "text": "সংখ্যাবাচক শব্দ কত প্রকার? CB 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-05-q30",
          "text": "'রাজপথ' কোন সমাসের উদাহরণ? CB 25",
          "options": [
            "দ্বন্দ্ব",
            "বহুব্রীহি",
            "কর্মধারয়",
            "তৎপুরুষ"
          ],
          "answer": 3
        }
      ]
    },
    {
      "paperId": "bangla2-06",
      "board": "CTGB25",
      "questions": [
        {
          "id": "bangla2-06-q1",
          "text": "যেসব ধ্বনি উচ্চারণের সময় জিভের ডগা মুধার সঙ্গে লেগে বায়ুপথে বাধা সৃষ্টি করে সেগুলোকে বলে- CTG.B 25",
          "options": [
            "মূর্ধন্য ধ্বনি",
            "তালব্য ধ্বনি",
            "দন্ত্য ধ্বনি",
            "কণ্ঠ্য ধ্বনি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q2",
          "text": "নিচের কোনটি 'উম্ম' ধ্বনির উদাহরণ? CTG.B 25",
          "options": [
            "স, শ, হ",
            "য, র,ল",
            "ড়,ঢ়,ষ",
            "ং,ঃ,ঁ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q3",
          "text": "নিচের কোনটি 'একজন এসে খবরটা দেয়।'- এখানে একজন' কোন প্রকারের সর্বনাম? CTG.B 25",
          "options": [
            "অনির্দিষ্ট",
            "সাপেক্ষ",
            "অন্যবাচক",
            "নির্দেশক"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q4",
          "text": "'পার্শ্বিক' ব্যঞ্জনধ্বনির উদাহরণ কোনটি? CTG.B 25",
          "options": [
            "গুণবাচক",
            "উপাদানবাচক",
            "বর্ণবাচক",
            "অবস্থাবাচক"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q5",
          "text": "কুন্তল' শব্দের প্রতিশব্দ কোনটি? CTG.B 25",
          "options": [
            "চোখ",
            "কান",
            "চুল",
            "কপাল"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q6",
          "text": "শব্দজোড়ে শব্দের অর্থের পার্থক্য বোঝা CTG.B 25",
          "options": [
            "সমাজ বিবেচনায়",
            "স্থান বিবেচনায়",
            "প্রসঙ্গ বিবেচনায়",
            "কাল বিবেচনায়"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q7",
          "text": "'অনুরক্ত' শব্দটির বিপরীত শব্দ কোনটি? CTG.B 25",
          "options": [
            "আসক্ত",
            "উত্ত",
            "রিক্ত",
            "বিরক্ত"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q8",
          "text": "'অভিজাত' উপসর্গযোগে গঠিত শব্দে 'অভি' উপসর্গটিতে কী অর্থ প্রকাশ পেয়েছে? CTG.B 25",
          "options": [
            "উত্তম",
            "সম্যক",
            "অধিক",
            "ঈষৎ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q9",
          "text": "'লোচন' শব্দের সমার্থক শব্দ কোনটি? CTG.B 25",
          "options": [
            "ললাট",
            "চাঁদ",
            "কপাল",
            "চোখ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q10",
          "text": "প্রত্যক্ষ উক্তি থেকে পরোক্ত উক্তিতে পরিবর্তনের ক্ষেত্রে কখন ক্রিয়ার কালের কোনো পরিবর্তন হয় না? CTG.B 25",
          "options": [
            "চিরন্তন সত্য হলে",
            "অনুজ্ঞাসূচক হলে",
            "আবেগসূচক হলে",
            "প্রশ্নবোধক হলে"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q11",
          "text": "বিধেয় ক্রিয়ার বিশেষ্য অংশকে বলে- CTG.B 25",
          "options": [
            "প্রসারক",
            "পূরক",
            "উদ্দেশ্য",
            "বিধেয়"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q12",
          "text": "কোন ভাষার সঙ্গে বাংলা ভাষার ঘনিষ্ঠ সম্পর্ক রয়েছে? CTG.B 25",
          "options": [
            "কসিংহলি",
            "পর্তুগিজ",
            "পালি",
            "হিস্পানি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q13",
          "text": "কত বছর আগে ব্রাহ্মী লিপির জন্ম হয়? CTG.B 25",
          "options": [
            "প্রায় আড়াই হাজার বছর আগে",
            "প্রায় তিন হাজার বছর আগে",
            "প্রায় সাড়ে তিন হাজার বছর আগে",
            "প্রায় চার হাজার বছর আগে"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q14",
          "text": "'বাচ্য' ও 'উক্তি' ব্যাকরণে কোন অংশে আলোচিত হয়? CTG.B 25",
          "options": [
            "বাক্যতত্ত্বে",
            "ধ্বনিতত্ত্বে",
            "রূপতত্ত্বে",
            "অর্থতত্ত্বে"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q15",
          "text": "'ব্যঞ্জনবর্ণের' বিকল্প রূপের নাম কী? CTG.B 25",
          "options": [
            "স্বতন্ত্রবর্ণ",
            "যুক্তবর্ণ",
            "অনুবর্ণ",
            "কারবর্ণ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q16",
          "text": "কোন বর্ণের নিজস্ব কোনো ধ্বনি নেই? CTG.B 25",
          "options": [
            "হ",
            "ঞ",
            "এ",
            "ও"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q17",
          "text": "যেসব শব্দাংশ পদের সঙ্গে যুক্ত হলে বক্তব্য জোরালো হয়, সেগুলোকে কী বলে CTG.B 25",
          "options": [
            "বিভক্তি",
            "বচন",
            "প্রত্যয়",
            "বলক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q18",
          "text": "'মগের মুল্লুক' বাগ্ধারাটির অর্থ কী? CTG.B 25",
          "options": [
            "অপব্যবহার",
            "সুযোগসন্ধানী",
            "অরাজকতা",
            "নতুন আগমন"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q19",
          "text": "অতিরিক্ত তথ্য উপস্থাপন ও কাল-নির্দেশের ক্ষেত্রে কোন বিরামচিহ্ন ব্যবহার করা হয়? CTG.B 25",
          "options": [
            "হাইফেন",
            "বন্ধনী",
            "ত্রিবিন্দু",
            "কোলন"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q20",
          "text": "শরতে শিউলি ফোটে।'-এটি কোন বাচ্যের উদাহরণ? CTG.B 25",
          "options": [
            "কর্মবাচ্য",
            "কর্তাবাচ্য",
            "ভাববাচ্য",
            "কর্ম-কর্তাবাচ্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q21",
          "text": "কোনটি অধিকরণ কারকের উদাহরণ? CTG.B 25",
          "options": [
            "জমি থেকে ফসল পাই।",
            "ফুলের গন্ধে ঘুম আসে না।",
            "অসহায়কে সাহায্য করো।",
            "বিকাল পাঁচটায় অফিস ছুটি হবে।"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q22",
          "text": "নিচের কোনটি সরল বাক্যের উদাহরণ? CTG.B 25",
          "options": [
            "লোকটি অশিক্ষিত হলেও অজ অভদ্র নয়।",
            "লোকটি অশিক্ষিত এবং অভদ্র নয়।",
            "লোকটি অশিক্ষিত কিন্তু অভদ্র নয়।",
            "যদিও লোকটি অশিক্ষিত তবুও অভদ্র নয়।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q23",
          "text": "বিশেষ্য সাধারণত কয় প্রকার? CTG.B 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "ছয়"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q24",
          "text": "কোনটি 'প্রযোজক ক্রিয়ার' উদাহরণ? CTG.B 25",
          "options": [
            "ঘণ্টা বেজে উঠল।",
            "ছেলেরা মাঠে বল খেলছে।",
            "পাখিটা ছটফটাচ্ছে।",
            "রাখাল গরুকে ঘাস খাওয়ায়।"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q25",
          "text": "'সকাল আটটার সময়ে সে রওয়ানা হলো।'- বাক্যে 'সকাল আটটার সময়'-কোন শ্রেণির বর্গ? CTG.B 25",
          "options": [
            "বিশেষ্য বর্গ",
            "বিশেষণ বর্গ",
            "ক্রিয়া-বিশেষণ বর্গ",
            "ক্রিয়া বর্গ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q26",
          "text": "'নবনবতিতম' সংখ্যাবাচক শব্দ দিয়ে কী প্রকাশ করে? CTG.B 25",
          "options": [
            "প্রথম",
            "১ম",
            "২রা",
            "বি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-06-q27",
          "text": "প্রত্যয়যোগে সাধিত নারীবাচক শব্দ কোনটি? CTG.B 25",
          "options": [
            "পুণ্যবতী",
            "সতীন",
            "মাতা",
            "ভাইঝি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-06-q28",
          "text": "অনুকার দ্বিত্ব কোনটি? CTG.B 25",
          "options": [
            "কুট কুট",
            "খকখক",
            "ঝিকিমিকি",
            "ঢংঢং"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-06-q29",
          "text": "' লাম' -এর সঠিক সন্ধি বিচ্ছেদ কোনটি? CTG.B 25",
          "options": [
            "বৃহঃ + পতি",
            "বৃহৎ + পতি",
            "বৃহস্ + পতি",
            "বৃহ + স্পতি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-06-q30",
          "text": "পারস্পরিক ক্রিয়ার কোনো অবস্থা তৈরি হলে তাকে কোন বহুব্রীহি সমাস বলে? CTG.B 25",
          "options": [
            "সমানাধিকার বহুব্রীহি",
            "ব্যাধিকরণ বহুব্রীহি",
            "ব্যতিহার বহুব্রীহি",
            "অলুক বহুব্রীহি"
          ],
          "answer": 2
        }
      ]
    },
    {
      "paperId": "bangla2-07",
      "board": "SB25",
      "questions": [
        {
          "id": "bangla2-07-q1",
          "text": "'অপরাজেয় বাংলা' কোন প্রকারের বিশেষ্যের উদাহরণ? SB 25",
          "options": [
            "কালনাম",
            "সৃষ্টিনাম",
            "ব্যক্তিনাম",
            "স্থাননাম"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-07-q2",
          "text": "নিচের কোন বাক্যটি আত্মবাচক সর্বনামের উদাহরণযুক্ত? SB 25",
          "options": [
            "একজন এসে খরবটা দেয়।",
            "যেমন কর্ম তেমন ফল।",
            "সে নিজে অঙ্কটা করছে।",
            "কী দিয়ে ভাত খায়?"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q3",
          "text": "অবস্থাবাচক বিশেষণ কোনটি? SB 25",
          "options": [
            "এক টাকা",
            "চলন্ত ট্রেন",
            "লাল ফিতা",
            "আধা কেজি চাল"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-07-q4",
          "text": "ধাতুর সাথে বিভক্তি যুক্ত হয়ে কী তৈরি হয়? SB 25",
          "options": [
            "শব্দ",
            "বাক্য",
            "ক্রিয়াপদ",
            "সর্বনাম পদ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q5",
          "text": "যৌগিক ক্রিয়া আছে কোন বাক্যে? SB 25",
          "options": [
            "পাখিটা ছটফটাচ্ছে।",
            "সে বই পড়ছে।",
            "সে তার অংশ বুঝে নিল।",
            "মা শিশুটিকে আদর করছেন।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-07-q6",
          "text": "গঠন বিবেচনায় ক্রিয়া বিশেষণকে কয় ভাগে ভাগ করা যায়? SB 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q7",
          "text": "'একটু ঘুরে আসুন না।'-বাক্যটিতে কোন ধরনের বিশেষণ ব্যবহৃত হয়েছে? SB 25",
          "options": [
            "নেতিবাচক",
            "ধরনবাচক",
            "কালবাচক",
            "পদানু ক্রিয়া"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q8",
          "text": "নিচের কোনটি প্রযোজক ক্রিয়ার ভাবী অসমাপিকা ক্রিয়াবিভক্তি? SB 25",
          "options": [
            "- আনো",
            "-ইয়ে",
            "- আতে",
            "- আলে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q9",
          "text": "পদ, বর্গ বা বাক্যকে যেসব শব্দ যুক্ত করে সেগুলোকে কী বলে? SB 25",
          "options": [
            "যোজক",
            "ধাতু",
            "ক্রিয়া",
            "অনুসর্গ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-07-q10",
          "text": "কোন ধরনের যোজক একে অপরের পরিপূরক হয়ে বাক্যে ব্যবহৃত হয়? SB 25",
          "options": [
            "বিকল্প",
            "কারণ",
            "সাধারণ",
            "সাপেক্ষ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q11",
          "text": "যাক গে, ওসব কথা থাক্।-বাক্যটিতে কোন ধরনের আবেগ ব্যবহৃত হয়েছে? SB 25",
          "options": [
            "করুণা",
            "অলংকার",
            "বিরক্তি",
            "প্রশংসা"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q12",
          "text": "নিচের কোনটি সরল বাক্যের উদাহরণ? SB 25",
          "options": [
            "বিপদ ও দুঃখ একসাথে আসে।",
            "লোকটি অশিক্ষিত কিন্তু অভদ্র নয়।",
            "ভিক্ষুক কে টাকা দাও",
            "যে মেয়েটি প্রথম হয়েছে, সে আমার বোন।"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-07-q13",
          "text": "'গবাক্ষ' শব্দের দ্বারা 'জানালা' বোঝালে অর্থের কী ধরনের পরিবর্তন হয়? SB 25",
          "options": [
            "অর্থ বদল",
            "অর্থ প্রসার",
            "অর্থ সংকোচ",
            "অর্থের উন্নতি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-07-q14",
          "text": "যে বাক্যের ক্রিয়া-বিশেষ্য বাক্যের ক্রিয়াকে নিয়ন্ত্রণ কবে, তাকে——- বাচ্য বলে। SB 25",
          "options": [
            "কর্তাবাচ্য",
            "কর্মবাচ্য",
            "কর্তা-কর্মবাচ্য",
            "ভাববাচ্য"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q15",
          "text": "'শ্রমবিমূখ' অর্থ কোন বাগধারার মধ্যে রয়েছে? SB 25",
          "options": [
            "উড়নচণ্ডি",
            "তীর্থের কাক",
            "ননীর পুতুল",
            "ছা-পোষা"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q16",
          "text": "ব্রাহ্মীলিপির কোন শাখা দশম শতক নাগাদ কুটিল লিপি নামে পরিচিতি লাভ করে? SB 25",
          "options": [
            "দ্রাবিড়ীয়",
            "আফ্রিকীয়",
            "দক্ষিণ-ভারতীয়",
            "পশ্চিম-ভারতীয়"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q17",
          "text": "'শব্দ গঠন প্রক্রিয়া' ব্যাকরণের কোন অংশে বিশেষ গুরুত্ব পায়? SB 25",
          "options": [
            "ধ্বনিতত্ত্ব",
            "রূপতত্ত্ব",
            "বাক্যতত্ত্ব",
            "অর্থতত্ত্ব"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-07-q18",
          "text": "অতিরিক্ত তথ্য উপস্থাপন ও কাল নির্দেশের ক্ষেত্রে কোন যতিচিহ্নের ব্যবহার হয়? SB 25",
          "options": [
            "কোলন",
            "উদ্ধার চিহ্ন",
            "বন্ধনী",
            "বিকল্প চিহ্ন"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-07-q19",
          "text": "মূর্ধন্য ব্যঞ্জনধ্বনির উদাহরণ কোনগুলো? SB 25",
          "options": [
            "চ, ছ, জ,শ",
            "ন, র, ল, স",
            "ত, থ, দ, ধ",
            "ট,ঠ, ড, ট"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q20",
          "text": "'নৈপুণ্য' অর্থে তদ্ধিত প্রত্যয়ের ব্যবহার হয়েছে কোন শব্দটিতে? SB 25",
          "options": [
            "নেয়ে",
            "টেকো",
            "চোরা",
            "বাহাদুরি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q21",
          "text": "'নবনবতিতম' সংখ্যাবাচক শব্দ দিয়ে কী প্রকাশ করে? SB 25",
          "options": [
            "প্রথম",
            "১ম",
            "২রা",
            "বি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q22",
          "text": "'সে খেয়ে আর ঘুমিয়ে কাটাচ্ছে'-এ বাক্যে 'খেলে আর ঘুমিয়ে' কোন প্রকারের বর্গ? SB 25",
          "options": [
            "বিশেষ্য বর্গ",
            "ক্রিয়া বিশেষণ বর্গ",
            "বিশেষণ বর্গ",
            "ক্রিয়া বর্গ"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-07-q23",
          "text": "নিপাতনে সিদ্ধ স্বরসন্ধি কোনটি? SB 25",
          "options": [
            "কূলটা",
            "স্বল্প",
            "মরুদ্যান",
            "গবাদি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q24",
          "text": "ব্যাসবাক্য কাকে ব্যাখ্যা করে ? SB 25",
          "options": [
            "পূর্বপদকে",
            "পরপদকে",
            "সমস্তপদকে",
            "সমস্যমান পদকে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q25",
          "text": "নিচের কোনটি পুনরাবৃত্ত দ্বিত্ব? SB 25",
          "options": [
            "কুটুস কুটুস",
            "খেক-টেক",
            "ফুসুর ফুসুর",
            "কথায় কথায়"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q26",
          "text": "যৌগিক ক্রিয়ার উদাহরণ কোনটি? SB 25",
          "options": [
            "মার খাওয়া",
            "এগিয়ে চলা",
            "ছটফট করা",
            "ব্যাট করা"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-07-q27",
          "text": "\"বাজারে সবজির দাম কমছে না\"-এ বাক্যে 'কমছে না' কোন ক্রিয়ার উদাহরণ? SB 25",
          "options": [
            "নামক্রিয়া",
            "সংযোগ ক্রিয়া",
            "যৌগিক ক্রিয়া",
            "সরল ক্রিয়া"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q28",
          "text": "নিচের কোনটি ক্রমবাচক সংখ্যাশব্দের প্রতিশব্দ? SB 25",
          "options": [
            "সমানাধিকার বহুব্রীহি",
            "ব্যাধিকরণ বহুব্রীহি",
            "ব্যতিহার বহুব্রীহি",
            "অলুক বহুব্রীহি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-07-q29",
          "text": "'সেলিম বাংলা ব্যাকরণে ভালো-এ বাক্যে' 'ব্যাকরণে' কোন কারক? SB 25",
          "options": [
            "কর্ম",
            "করণ",
            "অপাদান",
            "অধিকরণ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-07-q30",
          "text": "অভিধানে অর্থ গ্রহণের বেলায় শব্দের কোনটিকে প্রাধান্য দেওয়া হয়? SB 25",
          "options": [
            "বাচ্যার্থ",
            "লক্ষ্যার্থ",
            "গৌণার্থ",
            "অর্থপ্রসার"
          ],
          "answer": 0
        }
      ]
    },
    {
      "paperId": "bangla2-08",
      "board": "BB25",
      "questions": [
        {
          "id": "bangla2-08-q1",
          "text": "নিত্য অতীতের উদাহরণ কোনটি? BB 25",
          "options": [
            "তারা মাঠে খেলছিল।",
            "বাবা বাজার করেন।",
            "খুব সকালে ঘুম থেকে উঠতাম।",
            "তারা সেখানে বেড়াতে গেল।"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q2",
          "text": "'সপ্তমে চড়া' বাগারাটির অর্থ কী? BB 25",
          "options": [
            "অরাজকতা",
            "প্রচণ্ড উত্তেজনা",
            "সর্বনাশ",
            "উপযুক্ত মিলন"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q3",
          "text": "উত্তি পরিবর্তনের ক্ষেত্রে বাক্যের অর্থসংগতি রক্ষার জন্য কোন পদের পরিবর্তন করতে হয়? BB 25",
          "options": [
            "বিশেষ্য",
            "বিশেষণ",
            "অব্যয়",
            "সর্বনাম"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q4",
          "text": "বিধেয় ক্রিয়ার বিশেষ্য অংশকে কী বলা হয়? BB 25",
          "options": [
            "পূরক",
            "প্রসারক",
            "বলক",
            "নির্দেশক"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q5",
          "text": "নিচের কোন যুগল সাপেক্ষ সর্বনাম? BB 25",
          "options": [
            "যত-তত",
            "যারা-তারা",
            "যখন-তখন",
            "যেমন-তেমন"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q6",
          "text": "ঘোষ ব্যঞ্জনধ্বনির গুচ্ছ কোনটি? BB 25",
          "options": [
            "গ, ঘ, দ, ধ",
            "চ, ছ, ব, ভ",
            "ত, থ, ট, ঠ",
            "ত, দ,ট, ড"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q7",
          "text": "প্রথম বাংলা ব্যাকরণ রচয়িতা কে? BB 25",
          "options": [
            "মানোএল দা আসসুম্পসাঁউ",
            "রামমোহন রায়",
            "নাথানিয়েল ব্রাসি হ্যালহেড",
            "উইলিয়াম কেরি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q8",
          "text": "'নিমরাজি' শব্দের 'নিম' উপসর্গটি কোন অর্থদ্যোতক? BB 25",
          "options": [
            "অল্প",
            "প্রায়",
            "অর্ধেক",
            "সম্পূর্ণ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q9",
          "text": "'ডাক্তারকে জানাও'-বাক্যে 'ডাক্তার' কোন কারক? BB 25",
          "options": [
            "অধিকরণ",
            "করণ",
            "কর্ম",
            "কর্তা"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q10",
          "text": "মাতৃভাষী জনসংখ্যার দিকদিয়ে বাংলা পৃথিবীর কততম ভাষা? BB 25",
          "options": [
            "৪র্থ",
            "৫ম",
            "৬ষ্ঠ",
            "৭ম"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q11",
          "text": "স্বরবর্ণের মোট সংক্ষিপ্ত রূপ কয়টি? BB 25",
          "options": [
            "৮টি",
            "১০টি",
            "১১টি",
            "১২টি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q12",
          "text": "'লাউ' শব্দের মধ্যে কোন কোন স্বরধ্বনি আছে? BB 25",
          "options": [
            "আ+উ",
            "আ+ই",
            "অ+ই",
            "আ+এ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q13",
          "text": "'হাতাহাতি' কোন সমাসের উদাহরণ? BB 25",
          "options": [
            "দ্বন্দ্ব",
            "কর্মধারয়",
            "তৎপুরুষ",
            "বহুব্রীহি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q14",
          "text": "'চিঠিটা পড়া হয়েছে।'- এটি কোন বাচ্যের উদাহরণ? BB 25",
          "options": [
            "কর্ম-কর্তাবাচ্য",
            "ভাববাচ্য",
            "কর্তাবাচ্য",
            "কর্মবাচ্য"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q15",
          "text": "কৃৎপ্রত্যয় সাধিত শব্দকে কী বলে? BB 25",
          "options": [
            "পদান্ত",
            "তদ্ধিতান্ত",
            "কৃদন্ত",
            "ণিজন্ত"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q16",
          "text": "কোন সমাসে পূর্বপদ ও পরপদ উভয় পদের অর্থের সমান প্রাধান্য থাকে? BB 25",
          "options": [
            "বহুব্রীহি",
            "তৎপুরুষ",
            "দ্বন্দ্ব",
            "কর্মধারয়"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q17",
          "text": "যে সব শব্দাংশ পদের যুক্ত হয়ে পদকেনির্দিষ্ট করে, সেগুলোকে বলে- BB 25",
          "options": [
            "বচন",
            "বলক",
            "বিভক্তি",
            "নির্দেশক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q18",
          "text": "নিপাতনেসিদ্ধ স্বরসন্ধি কোনটি? BB 25",
          "options": [
            "গবাদি",
            "কুলটা",
            "একাদশ",
            "বৃহস্পতি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q19",
          "text": "'হিসহিস' শব্দটি কোন শব্দদ্বিত্বের উদাহরণ? BB 25",
          "options": [
            "ধ্বন্যাত্মক",
            "পদাত্মক",
            "পুনরাবৃত্ত",
            "অনুকার"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q20",
          "text": "'শীতার্ত' শব্দটির সঠিক সন্ধিবিচ্ছেদ কোনটি? BB 25",
          "options": [
            "শিত+ঋত",
            "শীত+আর্ত",
            "শিত+আর্ত",
            "শীত+ঋত"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q21",
          "text": "নিত্য নারীবাচক শব্দ কোনটি? BB 25",
          "options": [
            "কৃতদার",
            "শিক্ষিকা",
            "বিধবা",
            "জেঠি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q22",
          "text": "প্রত্যয়যোগে সাধিত নারীবাচক শব্দ কোনটি? BB 25",
          "options": [
            "পুণ্যবতী",
            "সতীন",
            "মাতা",
            "ভাইঝি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q23",
          "text": "নিচের কোনটি আরবি শব্দ? BB 25",
          "options": [
            "নগদ",
            "দোকান",
            "বোতল",
            "পাদরি"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-08-q24",
          "text": "শ্রোতা পক্ষের সর্বনাম নিচের কোনটি? BB 25",
          "options": [
            "আমি",
            "তিনি",
            "তুমি",
            "সে"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q25",
          "text": "কোনটি ক্রিয়া-বিশেষ্যের উদাহরণ? BB 25",
          "options": [
            "দয়া",
            "শয়ন",
            "মিছিল",
            "ধৈর্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q26",
          "text": "নিচের কোন বাক্যে অকর্মক ক্রিয়ার ব্যবহার হয়েছে? BB 25",
          "options": [
            "সে বই পড়ছে।",
            "শিক্ষক ছাত্রকে বই দিলেন।",
            "সে গল্প লিখছে।",
            "জনি দিনে ঘুমায়।"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-08-q27",
          "text": "অনুসর্গের গুচ্ছ কোনটি? BB 25",
          "options": [
            "সই, বাজ, পর্যন্ত",
            "আন, আনি, বদলে",
            "অবধি, আগে, ব্যতীত",
            "আম, খাস, নাগাদ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q28",
          "text": "'চাঁদ'-এর প্রতিশব্দ কোনটি? BB 25",
          "options": [
            "নিকেতন",
            "নিশাকর",
            "পুলিন",
            "সবিতা"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-08-q29",
          "text": "বাক্যের মধ্যকার একাধিক পদকে সংযুক্ত করতে কী ব্যবহৃত হয়? BB 25",
          "options": [
            "ড্যাশ",
            "কোলন",
            "হাইফেন",
            "সেমিকোলন"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-08-q30",
          "text": "কাঠামোগত পরিবর্তনের মাধ্যমে একবচন থেকে বহুবচন হয়েছে কোনটির? BB 25",
          "options": [
            "তারা",
            "শিক্ষকেরা",
            "রচনাবলি",
            "ভাইসব"
          ],
          "answer": 1
        }
      ]
    },
    {
      "paperId": "bangla2-09",
      "board": "JB25",
      "questions": [
        {
          "id": "bangla2-09-q1",
          "text": "কোনটি বাগ্যন্ত্রের মধ্যে সবচেয়ে সচল ও সক্রিয়? JB 25",
          "options": [
            "দন্ত",
            "তালু",
            "জিভ",
            "ওষ্ঠ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q2",
          "text": "বাংলা ভাষায় অর্ধস্বরধ্বনি কয়টি? JB 25",
          "options": [
            "তিনটি",
            "চারটি",
            "পাঁচটি",
            "ছয়টি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q3",
          "text": "ধ্বন্যাত্মক দ্বিত্বের উদাহরণ কোনটি? JB 25",
          "options": [
            "চকচক",
            "পর পর",
            "ধারধোর",
            "ুম ঘুম"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q4",
          "text": "'তৃতীয়' কোন ধরনের বিশেষণ? JB 25",
          "options": [
            "গুণবাচক",
            "ক্রমবাচক",
            "পরিমাণবাচক",
            "পূরণবাচক"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-09-q5",
          "text": "বাংলা কারবর্ণ কোনটি? JB 25",
          "options": [
            "১১টি",
            "১০টি",
            "৯টি",
            "৮টি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q6",
          "text": "ওষ্ঠ স্মৃষ্ট ব্যঞ্জনধ্বনি কোনটি? JB 25",
          "options": [
            "ব",
            "গ",
            "চ",
            "ত"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q7",
          "text": "'দৃশ্য'-এর শূদ্ধ উচ্চারণ কোনটি? JB 25",
          "options": [
            "দ্রিষ্য",
            "দ্রিস্শো",
            "দ্রিশশ",
            "দ্রিশশো"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-09-q8",
          "text": "যেসব শব্দ কোনো শব্দের পরে বসে শব্দটিকে বাক্যের সঙ্গে সম্পর্কিত করে, সেসব শব্দকে কী বলে? JB 25",
          "options": [
            "প্রত্যয়",
            "নির্দেশক",
            "অনুসর্গ",
            "বিভক্তি"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q9",
          "text": "'সম্পূর্ণ অর্থে কোন উপসর্গটি ব্যবহৃত হয়? JB 25",
          "options": [
            "স",
            "সম্-",
            "অধি-",
            "অভি-"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q10",
          "text": "নিচের কোনটি কৃদন্ত শব্দের উদাহরণ? JB 25",
          "options": [
            "দৈনিক",
            "দাপট",
            "দোলনা",
            "দীঘল"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q11",
          "text": "কোন সমাসে পূর্বপদ ও পরপদ উভয়টিরই অর্থের সমান প্রাধান্য থাকে? JB 25",
          "options": [
            "কর্মধারয়",
            "দ্বন্দ্ব",
            "তৎপুরুষ",
            "বহুব্রীহি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q12",
          "text": "নিপাতনে সিদ্ধ ব্যঞ্জনসন্ধি কোনটি? JB 25",
          "options": [
            "গবাক্ষ",
            "কুলটা",
            "জনৈক",
            "একাদশ"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-09-q13",
          "text": "নিচের কোনটি ক্রমবাচক সংখ্যাশব্দ? JB 25",
          "options": [
            "সপ্তম",
            "সপ্তমী",
            "সাতই",
            "সাত"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q14",
          "text": "উৎস বিবেচনায় বাংলা শব্দভান্ডার কয় শ্রেণিতেবিভন্ত? JB 25",
          "options": [
            "দুই",
            "তিন",
            "চার",
            "পাঁচ"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q15",
          "text": "কোন সর্বনাম নৈকট্য বা দূরত্ব নির্দেশ করে? JB 25",
          "options": [
            "নির্দেশক সর্বনাম",
            "সাপেক্ষ সর্বনাম",
            "অনির্দিষ্ট সর্বনাম",
            "সকলবাচক সর্বনাম"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q16",
          "text": "ক্রিয়ার রূপভেদ হয়- JB 25",
          "options": [
            "বচনভেদে",
            "কালভেদে",
            "লিঙ্গভেদে",
            "প্রয়োগভেদে"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q17",
          "text": "'চা না-হয় কফি খান।'-বাক্যটি কোন ধরনের যোজকের উদাহরণ? JB 25",
          "options": [
            "বিকল্প",
            "বিরোধ",
            "কারণ",
            "সাপেক্ষ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q18",
          "text": "কোন নির্দেশকটি দিয়ে কোনো কিছুর সামান্য অংশ বা অল্প পরিমাণ বোঝায়? JB 25",
          "options": [
            "জন",
            "টুকু",
            "খানা",
            "খানি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q19",
          "text": "বাক্যে গৌণকর্মের সঙ্গে সাধারণত কোন বিভক্তি বসে? JB 25",
          "options": [
            "-তে",
            "-এ",
            "-কে",
            "-র"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q20",
          "text": "ক্রিয়াপদের কয়টি অংশ? JB 25",
          "options": [
            "৫টি",
            "৪টি",
            "৩টি",
            "২টি"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-09-q21",
          "text": "যাকে অবলম্বন করে ক্রিয়া সম্পাদিত হয় তাকে কী বলে? JB 25",
          "options": [
            "বর্গ",
            "কর্তা",
            "কর্ম",
            "যোজক"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q22",
          "text": "বিধেয় ক্রিয়ার বিশেষ্য অংশকে কী বলে? JB 25",
          "options": [
            "পূরক",
            "প্রসারক",
            "উদ্দেশ্য",
            "নামশব্দ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q23",
          "text": "'আমরা তিন ভাইবোন।'-এটি কোন ধরনের বাক্য? JB 25",
          "options": [
            "অধীন",
            "সরল",
            "জটিল",
            "যৌগিক"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q24",
          "text": "কাব্যভাষায় কর্মকারকে কোন বিভক্তি যুক্ত হয়? JB 25",
          "options": [
            "-এর",
            "-কে",
            "-এ",
            "-রে"
          ],
          "answer": 3
        },
        {
          "id": "bangla2-09-q25",
          "text": "'চিঠিটা পড়া হয়েছে।'-এটি কোন বাচ্যের উদাহরণ? JB 25",
          "options": [
            "কর্তাবাচ্য",
            "কর্মবাচ্য",
            "ভাববাচ্য",
            "কর্মকর্তৃবাচ্য"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q26",
          "text": "প্রত্যক্ষ উক্তি লেখার সময়ে ব্যবহৃত যতিচিহ্ন কোনটি? JB 25",
          "options": [
            "উদ্ধারচিহ্ন",
            "বন্ধনীচিহ্ন",
            "সেমিকোলন",
            "হাইফেন"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q27",
          "text": "'বর্ষ' শব্দের অর্থ বছর হলে অর্থের কী ধরনের পরিবর্তন হয়? JB 25",
          "options": [
            "অর্থসংকোচ",
            "অর্থপ্রসার",
            "অর্থ-বদল",
            "অর্থের উন্নতি"
          ],
          "answer": 1
        },
        {
          "id": "bangla2-09-q28",
          "text": "'অসাবধান' অর্থে নিচের কোন বাগধারাটির প্রয়োগ হয়? JB 25",
          "options": [
            "উড়নচণ্ডী",
            "গড্ডলিকা প্রবাহ",
            "কাছাঢিলা",
            "খতমত খাওয়া"
          ],
          "answer": 2
        },
        {
          "id": "bangla2-09-q29",
          "text": "'বাতাস' শব্দের প্রতিশব্দ কোনটি? JB 25",
          "options": [
            "অনিল",
            "চপলা",
            "বিপিন",
            "অপ"
          ],
          "answer": 0
        },
        {
          "id": "bangla2-09-q30",
          "text": "নিচের কোনটি 'ত্বরিত' শব্দের বিপরীত অর্থ প্রকাশ করে? JB 25",
          "options": [
            "নির্বাপণ",
            "ক্ষীণ",
            "নিখুঁত",
            "শ্লথ"
          ],
          "answer": 3
        }
      ]
    }
  ]
}}'''

# Load JSON
data = json.loads(json_str)

# Your correct answers (in order: DB25 → JB25)
all_answers = [
    [3,2,0,1,3,0,2,3,1,1,3,0,2,1,1,3,0,3,0,0,1,0,2,3,2,1,0,1,2,2],   # DB25
    [3,3,1,1,1,2,2,0,0,3,0,3,0,0,2,1,1,0,3,0,2,1,3,2,0,0,3,1,3,3],   # MB25
    [2,0,1,3,2,2,1,3,2,0,1,3,2,0,1,3,2,0,1,3,1,2,2,0,1,3,2,0,3,3],   # RB25
    [1,0,0,3,2,3,1,1,2,3,0,3,3,1,2,0,2,0,2,1,3,0,3,1,3,1,2,0,3,1],   # DINB25
    [3,2,3,1,3,2,0,0,1,3,1,2,2,2,1,2,2,3,2,1,0,1,0,1,2,1,1,3,3,3],   # CB25
    [0,0,0,1,2,2,3,0,3,0,1,2,0,0,2,1,3,2,1,1,3,0,3,3,2,3,0,2,1,2],   # CTGB25
    [1,2,1,2,0,2,3,2,0,3,2,0,1,3,2,2,1,0,3,3,3,1,3,2,3,0,3,2,3,0],   # SB25
    [2,1,3,0,1,0,0,0,2,2,1,0,3,3,2,2,3,1,0,3,2,1,0,2,1,3,2,1,2,1],   # BB25
    [2,1,0,3,1,0,3,2,0,2,1,3,1,2,0,1,0,1,2,3,1,0,1,3,1,0,1,2,0,3]    # JB25
]

# Map paperId to index (adjust order if your JSON has different sequence)
paper_order = ["bangla2-01", "bangla2-02", "bangla2-03", "bangla2-04", "bangla2-05", "bangla2-06", "bangla2-07", "bangla2-08", "bangla2-09"]

for idx, paper_id in enumerate(paper_order):
    for paper in data["papers"]:
        if paper["paperId"] == paper_id:
            for q_idx, question in enumerate(paper["questions"]):
                question["answer"] = all_answers[idx][q_idx]
            break

# Save the updated JSON
with open("bangla2_updated.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=2)

print("JSON updated successfully! File saved as: bangla2_updated.json")